src/Documents/СпецификацияКДоговоруСПоставщиком/СпецификацияКДоговоруСПоставщиком.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СпецификацияКДоговоруСПоставщиком</name>
  <basedOn>Catalog.Договоры</basedOn>
  <registerRecords>AccumulationRegister.ДоговорыСПоставщиками</registerRecords>
  <registerRecords>InformationRegister.ЦеныПлановые</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/СпецификацияКДоговоруСПоставщиком/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция ПолучитьМПЗ(Наименование)
Возврат(Справочники.Материалы.НайтиПоНаименованию(Наименование,Истина)); 
КонецФункции

&НаСервере
Процедура ДобавитьМПЗ(МПЗ,Количество,Цена)
ТЧ = Объект.ТабличнаяЧасть.Добавить();
ТЧ.МПЗ = МПЗ;
ТЧ.Количество = Количество;
ТЧ.Цена = Цена;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c договорными позициями");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка договорных позиций из файла..."); 
		НаименованиеМПЗ = СокрЛП(ExcelЛист.Cells(к,1).Value);
		МПЗ = ПолучитьМПЗ(НаименованиеМПЗ);
			Если Не МПЗ.Пустая() Тогда
			ДобавитьМПЗ(МПЗ,Число(ExcelЛист.Cells(к,2).Value),Число(ExcelЛист.Cells(к,3).Value));
			Иначе
			Сообщить(НаименованиеМПЗ + " - МПЗ не найден!");
			КонецЕсли; 
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПодборМПЗНаСервере(ТаблицаМПЗ)
	Для каждого ТЧ_МПЗ Из ТаблицаМПЗ Цикл
	ТЧ = Объект.ТабличнаяЧасть.Добавить();
	ТЧ.МПЗ = ТЧ_МПЗ.МПЗ;
	ТЧ.Количество = ТЧ_МПЗ.Количество;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ПодборМПЗ(Команда)
ТаблицаМПЗ = ОткрытьФормуМодально("ОбщаяФорма.ПодборМПЗ", Новый Структура("МестоХранения,Договор",Неопределено,Объект.Договор));
	Если ТаблицаМПЗ <> Неопределено Тогда
		Если ТаблицаМПЗ.Количество() > 0 Тогда
			Если Объект.ТабличнаяЧасть.Количество() > 0 Тогда
				Если Вопрос("Очистить таблицу?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.ТабличнаяЧасть.Очистить();		
				КонецЕсли; 			
			КонецЕсли; 
		ПодборМПЗНаСервере(ТаблицаМПЗ);
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПроверитьДоговор(Договор)
	Если Договор.ПометкаУдаления Тогда
	Сообщить("Договор помечен на удаление.");
	Возврат(Ложь); 
	КонецЕсли;
		Если Договор.ДоговорСНефиксированнымиЦенами Тогда
		Сообщить("Договор с нефиксированными ценами.");
		Возврат(Ложь); 
		КонецЕсли; 
			Если Не Договор.УчётКоличества Тогда
			Сообщить("Договор без учёта количества.");
			Возврат(Ложь); 
			КонецЕсли; 
Возврат(Истина); 
КонецФункции

&НаКлиенте
Процедура ДоговорОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
СтандартнаяОбработка = ПроверитьДоговор(ВыбранноеЗначение); 
КонецПроцедуры
